'''
运算符
    1）算术运算符：+、-、*、/、%、//
    其中：// 取整除，返回商的整数部分（向下取整）
    2）赋值运算符：=、+=、-=、*=、/=、//=、%=、**=
    3）比较运算符：>、<、>=、<=、==
    4）逻辑运算符：not、and、or
    其中：优先级为非 > 与 > 或

    python没有三目运算符
	python支持相连比较（eg:a>b>c)
'''

# 运算符
print("Hens", 25 + 30 / 5)

# 布尔值
print("boolean", 3 + 2 > 5 - 7)

# 测试<=与>=运算符
print("5 <= -2", 5 <= -2)

# 获取商
print("9//2 = ", 9 // 2)

# 获取余数
print("9%2 = ", 9 % 2)

# 指数运算
print("2**3 = ", 2 ** 3)

# python支持相连比较
print("5>4>3 = ", 5 > 4 > 3)

# 异或
print("2 ^ 1 = ", 2 ^ 1)
